const ADVANTAGES = [
  {
    id: '001',
    icon: 'fal fa-drafting-compass',
    header: 'Проектирование',
    text: 'Быстро и эффективно спроектируем здание удовлетворяющее Вашим требованиям',
    link: '#',
  },
  {
    id: '002',
    icon: 'fal fa-industry-alt',
    header: 'Изготовление',
    text: 'Качественное производство продукции - наша главная цель. Изготовление каркасов и ограждений.',
    link: '#',
  },
  {
    id: '003',
    icon: 'fal fa-warehouse',
    header: 'Монтаж',
    text: 'Комплексный подход к проектированию и производству - это высокие скорость и качество при монтаже',
    link: '#',
  },
  {
    id: '004',
    icon: 'fal fa-award',
    header: 'Цены',
    text:
      'Наш подход к формированию цены, надеемся, Вас приятно удивит. Попробуйте наш калькулятор или оставьте заявку.',
    link: '#',
  },
];

export default ADVANTAGES;
