export const projectsOrder = [5, 7, 6, 10, 11, 15, 8, 9, 4, 13, 12, 1, 2, 3, 14];

export interface IProject {
  id: number;
  name: string;
  location: string;
  description: string;
  photos: number[];
  coordinates: number[];
}

export const projects: IProject[] = [
  {
    // Ангар в Якутии
    id: 1,
    name: 'Ангар 13,5х15м',
    location: 'п.Усть-Нера, Якутия',
    description: 'Утепленный ангар для хранения и обслуживания вертолета AS 350 В2.',
    photos: [1, 2, 5, 3, 4],
    coordinates: [64.572303, 143.231447],
  },
  {
    // Спортнавес Патриот
    id: 2,
    name: 'Навес над спортплощадкой',
    location: 'Парк "Патриот", Московская область',
    description: 'Навес над спортивной площадкой.',
    photos: [1, 2, 3, 4, 5],
    coordinates: [55.557493, 36.82913],
  },
  {
    // Тепляк
    id: 3,
    name: 'Технологическое тентовое укрытие',
    location: 'г.Москва, р-н Андроновка',
    description: 'Тепляк для бетонирования пролетного строения в зимнее время',
    photos: [1, 5, 2, 3, 4],
    coordinates: [55.747153, 37.737833],
  },
  {
    // Ангар в Савельево
    id: 4,
    name: 'Цех 24х36х7м',
    location: 'д.Савельево, Ярославская область',
    description: 'Каркасно-тентовый цех для производства удобрений',
    photos: [4, 5, 6, 1, 2, 3],
    coordinates: [56.646114, 38.623646],
  },
  {
    // Ангар в Ромашково
    id: 5,
    name: 'Ангар 30х18х6,5м',
    location: 'д.Ромашково, Московская область',
    description: 'Утепленный ангар для хранения и обслуживания вертолётов.',
    photos: [1, 2, 3, 5, 6, 4],
    coordinates: [55.725261, 37.332208],
  },
  {
    // Навигатор
    id: 6,
    name: 'Ангар 18х80х6м',
    location: 'г. Мытищи, Московская область',
    description: 'Шоу-рум по продаже гранита и мрамора',
    photos: [1, 2, 3, 4, 5],
    coordinates: [55.910109, 37.671315],
  },
  {
    // Алмазово КСК
    id: 7,
    name: 'Конно-спортивный комплекс',
    location: 'д.Алмазово, Московская область',
    description: 'Манеж, конюшни, "бочки", склады сена, летние конюшни.',
    photos: [1, 2, 7, 15, 6, 3, 5, 4, 16, 11, 13, 12, 14, 8, 9, 10],
    coordinates: [55.838476, 38.049136],
  },
  {
    // Сергиев-Посад КСК
    id: 8,
    name: 'Конный манеж',
    location: 'г.Сергиев-Посад, Московская область',
    description: 'Здание из сендвич-панелей.',
    photos: [2, 1, 3, 7, 4, 5, 6],
    coordinates: [56.300639, 38.160582],
  },
  {
    // Ивановская птицефабрика
    id: 9,
    name: 'Строительство новых цехов',
    location: 'д.Шилыково, Ивановская область',
    description: 'Реконструкция птицефабрики. Строительство новых цехов для содержания стада несушек',
    photos: [13, 14, 15, 16, 1, 9, 10, 2, 3, 11, 12, 6, 4, 5, 7, 17],
    coordinates: [56.92512, 40.747767],
  },
  {
    // Навес в Дорохово
    id: 10,
    name: 'Навес 15х60х6м',
    location: 'п.Дорохово, Московская область',
    description: 'Навес с ограждениями из профлиста',
    photos: [1, 9, 2, 3, 4, 5, 6, 7, 8],
    coordinates: [55.548438, 36.353927],
  },
  {
    // Ангар в Есипопо
    id: 11,
    name: 'Ангар 22х54х5м',
    location: 'д.Есипово, Московская область',
    description: 'Тентовый ангар для хранения грузовых автошин',
    photos: [1, 2, 4, 5, 6, 7],
    coordinates: [56.100555, 37.100098],
  },
  {
    // Ябедино КСК
    id: 12,
    name: 'Конно-спортивный комплекс',
    location: 'д.Ябедино, Московская область',
    description: 'Манеж, конюшни, "бочки", склады сена, летние конюшни.',
    photos: [6, 7, 8, 9, 15, 16, 18, 17, 23, 12, 13, 14, 11, 10, 19, 20, 22, 21, 1, 3, 4, 5, 2],
    coordinates: [55.905621, 36.795128],
  },
  {
    // Курилово
    id: 13,
    name: 'Торговый павильон',
    location: 'д.Курилово, Московская область',
    description: 'Каркасно-тентовый торговый павильон.',
    photos: [7, 4, 5, 6, 1, 2, 3, 8],
    coordinates: [56.100256, 36.912058],
  },
  {
    // Онуфриево
    id: 14,
    name: 'Конный комплекс',
    location: 'д.Онуфриево, Московская область',
    description: 'В комплекс входят манеж, конюшня и вспомогательные сооружения',
    photos: [13, 12, 9, 10, 7, 8, 3, 4, 5, 6, 1, 2],
    coordinates: [55.845359, 36.495301],
  },
  {
    // Леличи
    id: 15,
    name: 'Тентовый склад',
    location: 'д.Леличи, Московская область',
    description: 'Склад для хранения готовой продукции',
    photos: [1, 2, 3, 4, 5, 6],
    coordinates: [55.200594, 39.358015],
  },
];
