const newsArray = [
  {
    id: '001',
    image: '/img/photos/gallery/009__002-photo-',
    date: '2018-06-25',
    dateLocal: '25.06.2018',
    header: 'Сдан цех для содержания кур-несушек',
    text:
      'Цех имеет длину 84 метра. Фабрика расположена в деревне Шилыково Ивановской области. Так же мы смонтировали технологическое оборудование.',
  },
  {
    id: '002',
    image: '/img/photos/gallery/005__003-photo-',
    date: '2017-10-17',
    dateLocal: '17.10.2017',
    header: 'Закончен ангар для вертолетов',
    text:
      'Смортировали и сдали заказчику ангар для хранения и ослуживания вертолетов в деревне Ромашково Московской области.',
  },
  {
    id: '003',
    image: '/img/photos/gallery/010__007-photo-',
    date: '2019-06-10',
    dateLocal: '10.06.2019',
    header: 'Закончили навес из профнастила',
    text:
      'Размеры строения 15х60х6 метров. Назначение здания - склад готовой продукции. Расположение - город Дорохово в Москоской области.',
  },
  {
    id: '004',
    image: '/img/photos/gallery/009__005-photo-',
    date: '2019-06-22',
    dateLocal: '22.06.2019',
    header: 'Сдан второй цех для содержания кур',
    text:
      'Цех имеет длину 84 метра. Фабрика расположена в деревне Шилыково Ивановской области. Так же мы смонтировали технологическое оборудование.',
  },
  {
    id: '005',
    image: '/img/photos/gallery/007__015-photo-',
    date: '2019-08-05',
    dateLocal: '05.08.2019',
    header: 'Сдан в эксплуатацию КСК "Алмазово"',
    text: 'Конно-спортивный комплекс около д.Алмазово Московской области',
  },
  {
    id: '006',
    image: '/img/photos/gallery/011__004-photo-',
    date: '2019-10-12',
    dateLocal: '12.10.2019',
    header: 'Сдали тентовый склад для автошин',
    text: 'Заказчик принял у нас тентовый склад в деревне Есипово в Московской области',
  },
  {
    id: '007',
    image: '/img/photos/gallery/009__008-photo-',
    date: '2020-09-18',
    dateLocal: '18.09.2020',
    header: 'Сдан следующий цех для содержания кур',
    text: 'Цех на 70 000 голов. Фабрика расположена в деревне Шилыково Ивановской области.',
  },
  {
    id: '008',
    image: '/img/photos/gallery/013__002-photo-',
    date: '2020-07-10',
    dateLocal: '10.07.2020',
    header: 'Построен торговый павильон из ПВХ-ткани',
    text:
      'Мы сдали заказчику тентовый павильон для торговли. Размеры здания 18х32х4 метров. Площадка расположена около деревни Курилово в Москоской области.',
  },
  {
    id: '009',
    image: '/img/photos/gallery/012__009-photo-',
    date: '2020-08-20',
    dateLocal: '20.08.2020',
    header: 'Введен в эксплуатацию КСК',
    text: 'Запустили конно-спортивный комплекс в д.Ябедино в Московской области.',
  },
  {
    id: '010',
    image: '/img/photos/gallery/004__003-photo-',
    date: '2017-08-21',
    dateLocal: '21.08.2017',
    header: 'Сдали тентовый цех',
    text: 'Цех с двойным тентом в Ярославской области. Здание предназначено для размещения производства.',
  },
  {
    id: '011',
    image: '/img/photos/gallery/015__004-photo-',
    date: '2021-01-15',
    dateLocal: '15.01.2021',
    header: 'Закончен и сдан заказчику тентовый склад',
    text:
      'Склад расположен на территории завода и предназначен для готовой продукции не требующей теплого помещения для хранения.',
  },
  {
    id: '012',
    image: '/img/photos/gallery/014__013-photo-',
    date: '2020-12-28',
    dateLocal: '28.12.2020',
    header: 'Завершили строительство КСК',
    text:
      'Конно-спортивный комплекс в деревне Онуфриево, Москоской области. На этот год все. Манеж закончили. В 2021 году конюшни и прочая инфраструктура.',
  },
];
export default newsArray;
